In [1]:
import pandas as pd
import pymysql                        
from sqlalchemy import create_engine  
from getpass import getpass
password = getpass()

········

In [2]:
# 1. Establish a connection between Python and the Sakila database.

connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [3]:
# 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters)
#from the Sakila database as a Pandas DataFrame.

def rentals_month (engine, month, year):
    query = f"""SELECT rental_id, rental_date, return_date, customer_id FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year};"""
    df = pd.read_sql_query(query, engine)
    return df

In [4]:
df_rentals_month_may = rentals_month(engine, 5, 2005)
df_rentals_month_may

      rental_id         rental_date         return_date  customer_id
0             1 2005-05-24 22:53:30 2005-05-26 22:04:30          130
1             2 2005-05-24 22:54:33 2005-05-28 19:40:33          459
2             3 2005-05-24 23:03:39 2005-06-01 22:12:39          408
3             4 2005-05-24 23:04:41 2005-06-03 01:43:41          333
4             5 2005-05-24 23:05:21 2005-06-02 04:33:21          222
...         ...                 ...                 ...          ...
1151       1153 2005-05-31 21:36:44 2005-06-10 01:26:44          506
1152       1154 2005-05-31 21:42:09 2005-06-08 16:40:09           59
1153       1155 2005-05-31 22:17:11 2005-06-04 20:27:11          251
1154       1156 2005-05-31 22:37:34 2005-06-01 23:02:34          106
1155       1157 2005-05-31 22:47:45 2005-06-02 18:01:45           61

[1156 rows x 4 columns]

In [5]:
df_rentals_month_june = rentals_month(engine, 6, 2005)
df_rentals_month_june

      rental_id         rental_date         return_date  customer_id
0          1158 2005-06-14 22:53:33 2005-06-18 21:37:33          416
1          1159 2005-06-14 22:55:13 2005-06-17 02:11:13          516
2          1160 2005-06-14 23:00:34 2005-06-18 01:58:34          239
3          1161 2005-06-14 23:07:08 2005-06-21 17:12:08          285
4          1162 2005-06-14 23:09:38 2005-06-23 22:00:38          310
...         ...                 ...                 ...          ...
2306       3465 2005-06-21 22:10:01 2005-06-30 21:35:01          510
2307       3466 2005-06-21 22:13:33 2005-06-25 21:01:33          226
2308       3467 2005-06-21 22:19:25 2005-06-27 00:03:25          543
2309       3468 2005-06-21 22:43:45 2005-06-30 01:49:45          100
2310       3469 2005-06-21 22:48:59 2005-06-28 19:32:59          181

[2311 rows x 4 columns]

In [6]:
#3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input 
# along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id 
# during the selected month and year.

In [7]:
# We did not have a seperate column for month and year in the dataframe so we have to extract that first. 
# Then we want to filter on this month and date combination. 
# On this filtered data we want to group by customer ID, the output of a groupby function is not like the original dataframe so we need to reset the index and name the column as described.
# https://www.geeksforgeeks.org/how-to-reset-index-after-groupby-pandas/

def rental_count_month (df, month, year):
    df['rental_month'] = df['rental_date'].dt.month
    df['rental_year'] = df['rental_date'].dt.year
    rentals_filtered = df[(df['rental_month'] == month) & (df['rental_year'] == year)]
    rental_counts = rentals_filtered.groupby('customer_id').size().reset_index(name='rentals_{}_{}'.format(month, year))
    return rental_counts

In [8]:
df_rental_count_month_may = rental_count_month(df_rentals_month_may, 5, 2005)
df_rental_count_month_may

     customer_id  rentals_5_2005
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

In [9]:
df_rental_count_month_june = rental_count_month(df_rentals_month_june, 6, 2005)
df_rental_count_month_june

     customer_id  rentals_6_2005
0              1               7
1              2               1
2              3               4
3              4               6
4              5               5
..           ...             ...
585          595               2
586          596               2
587          597               3
588          598               1
589          599               4

[590 rows x 2 columns]

In [10]:
# 4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals 
#made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' 
#column, which is the difference between the number of rentals in the two months.

In [11]:
# First I wanted to use concat but we want to join the dataframes on the customer_id so I searched for an equvilant to that in Pandas
# https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html
# It seems that there are customer_id's in the second dataframe that are not in the first dataframe. In the end we want to have all rows from both datadrames in the result.
# That is why I have two (left) merged dataframes.In df_merged_1 you have all columns from df1 and in df_merged_2 we have all columns from df2.

def compare_rentals (df1, month_1, year_1, df2, month_2, year_2):
    df_merged_1 = pd.merge(df1, df2, on='customer_id', how = 'left')
    df_merged_2 = pd.merge(df2, df1, on='customer_id', how = 'left')
    df = pd.concat([df_merged_1, df_merged_2], ignore_index=True)
    
    #If i concat the two merged dataframes I have a lot of duplicates that I need to drop again.
    df.drop_duplicates(subset=['customer_id', 'rentals_5_2005', 'rentals_6_2005'], inplace = True)
    
    #Afterwards I want to sort it to see if for example customer_id 4 appears in the dataframe.
    df.sort_values('customer_id', inplace=True)
    
    #Because there were a few rows that did not exist in both dataframes and therefor got NaN value, I want to replace that by 0.
    df = df.fillna(0)
    
    #To make it prettier I reset the index.
    df.reset_index(drop = True, inplace = True)
    
    #And last but not least I want to add the difference column
    df['difference'] = df['rentals_{}_{}'.format(month_1, year_1)]- df['rentals_{}_{}'.format(month_2, year_2)]
    return df

In [12]:
df_compare_rentals = compare_rentals(df_rental_count_month_may, 5, 2005, df_rental_count_month_june, 6, 2005)
df_compare_rentals

     customer_id  rentals_5_2005  rentals_6_2005  difference
0              1             2.0             7.0        -5.0
1              2             1.0             1.0         0.0
2              3             2.0             4.0        -2.0
3              4             0.0             6.0        -6.0
4              5             3.0             5.0        -2.0
..           ...             ...             ...         ...
593          595             1.0             2.0        -1.0
594          596             6.0             2.0         4.0
595          597             2.0             3.0        -1.0
596          598             0.0             1.0        -1.0
597          599             1.0             4.0        -3.0

[598 rows x 4 columns]